[
  {
    "id": "craig_labenz",
    "name": "Craig Labenz",
    "title": "Flutter DevRel",
    "company": "Google",
    "social": {
      "twitter": "https://twitter.com/craig_labenz",
      "github": "",
      "linkedin": ""
    },
    "talk": {
      "title": "Managing state in a Flutter game",
      "description": "In this talk, Craig will use Riverpod to manage state in a maze escape game. We will discuss how game state management is not inherently different from normal Flutter app state management. We'll also discuss the Command Pattern, and how it can help keep your Flutter apps sufficiently decoupled and flexible. Lastly, we'll use our decoupled system to seamlessly add voice commands to the game, allowing players on mobile or mobile web to shout commands.",
      "lightening": false
    },
    "bio": "Craig is a developer who found Flutter after a decade of making web apps with Python and JavaScript. He enjoys thinking about the entire spectrum of his projects; all the way from the CSS (or the Flutter theme!) to the state management, the API design, the database, and the deployment. Like everyone else, when he first found Flutter, it was a combination of hot reload and Dart's developer experience that hooked him. You might recognize him acting out his favorite hobby, 'being a goof', on YouTube."
  },
  {
    "id": "frank_van_puffelen",
    "name": "Frank van Puffelen",
    "title": "Firebase DevRel",
    "company": "Google",
    "social": {
      "twitter": "https://twitter.com/puf",
      "github": "",
      "linkedin": ""
    },
    "talk": {
      "title": "Sharing game state across users with Firebase",
      "description": "<p>In his talk earlier in the conference Craig built a small maze game, to show us how to isolate game state and game logic from the user interface of our game. Now Frank will take that game add some multiplayer features to it with Firebase.</p><p>First we'll add a counter that shows how many people are currently playing the game. Then we'll store the position of the avatar in the database too, so that we all have to work together to guide them to the exit. And then finally we'll play a couple of rounds, where we all yell at our phones and laptop to make it to the exit. LEFT - LEFT - LEFT - NO NO NO - UP - UP….</p>!",
      "lightening": false
    },
    "bio": "Frank is an engineer for Firebase at Google. He helps developers build extraordinary apps that use Firebase as their back-end, and is the host of Firebase Release Notes on YouTube. If you've ever asked a Firebase question on StackOverflow, you've probably met Frank already."
  },
  {
    "id": "felix_angelov",
    "name": "Felix Angelov",
    "title": "Software engineer",
    "company": "very good ventures",
    "social": {
      "twitter": "https://twitter.com/felangelov",
      "github": "https://github.com/felangel",
      "linkedin": ""
    },
    "talk": {
      "title": "Managing State with Bloc v8",
      "description": "TBA",
      "lightening": false
    },
    "bio": "A deep dive into what has changed in version 8.0.0 of the bloc state management library. We’ll take a look at what sparked these changes, how to migrate to v8.0.0, and explore advanced use cases with an emphasis on concurrency, testing, and tooling. Attendees will hopefully leave the talk with a clear understanding of all major changes introduced in bloc v8.0.0 as well as an intro to the bloc_concurrency package. We’ll go over the built-in event transformers, talk about when to use them, and see how to implement a custom event transformer."
  },
  {
    "id": "simon_lightfoot",
    "name": "Simon Lightfoot",
    "title": "FlutterWhisperer",
    "company": "FlutterLondon",
    "social": {
      "twitter": "https://twitter.com/devangelslondon",
      "github": "",
      "linkedin": ""
    },
    "talk": {
      "title": "Flutter vs. Zombies",
      "description": "TBA",
      "lightening": false
    },
    "bio": "Simon loves Flutter and believes its the future of Mobile development. Co-founder Flutter Study Group on Slack, HumpdayQandA and Flutter Community Lead. He's been writing code for 18+ years, of which the last 10 years has been professional Android development. He discovered Flutter in Oct 2017 and since then has not looked back."
  },
  {
    "id": "pooja_bhaumik",
    "name": "Pooja Bhaumik",
    "title": "GDE",
    "company": "",
    "social": {
      "twitter": "https://twitter.com/pblead26",
      "github": "https://github.com/PoojaB26",
      "linkedin": ""
    },
    "talk": {
      "title": "Diagnostic Tests for Flutter Apps: Debugging Techniques",
      "description": "<p>Maybe the most important thing about development is not writing code, it is probably, efficiently and quickly finding and fixing the code that is causing the expected behaviour of your application. Flutter provides a number of tools and features to help debug applications, and the complete understanding of these tools is crucial for developers working in projects, specially production level apps.</p> <p>In this talk, I will discuss about the various methods of debugging, such as the Devtools built specially for Flutter and Dart that helps a developer debug memory issues, check diagnostics information, diagnose UI jank performance issues, etc. Other than that, we will also talk about the debugging tools provided by Android Studio and VS Code themselves and other miscellaneous tools or features to debug animations, inspect widgets, etc.</p><p>By the end of the talk, the attendees will know how to choose the right tool for the diagnostic tests for their Flutter applications, and hopefully gain speed at fixing issues in their code. </p>",
      "lightening": false
    },
    "bio": "Pooja Bhaumik is a technical mentor at Startup Clinic initiative by Google For Startups, a Google Developer Expert for Flutter, former Senior Engineer at Bounce & CreatorStack and contributing author to Increment by Stripe. When she is not writing code, she either enjoys mentoring folks to help them grow in their development careers or contributes to the tech community through blog posts, public speaking, Youtube videos, and open source contributions. She is also passionate about diversity & inclusion and has co-founded WomenDroid to support personal & professional growth objectives for women developers."
  },
  {
    "id": "andrei_diaconu",
    "name": "Andrei Diaconu",
    "title": "Software Engineer",
    "company": "Microsoft",
    "social": {
      "twitter": "https://twitter.com/andreidiaconu",
      "github": "https://github.com/andreidiaconu",
      "linkedin": ""
    },
    "talk": {
      "title": "Does your layout fold?",
      "description": "With the newly released foldable support in Flutter, your app can now adapt to support them. What can your app do to offer an enhanced experience for your users? Let's look at a few cases and discuss the broader context of developing for large screens.",
      "lightening": false
    },
    "bio": "Passionate about mobile and with a lot of experience on both Android and Flutter, Andrei is here to help you navigate the foldable world. He is part of the Microsoft Surface Duo team and is making sure you have a great time developing for it using Flutter."
  },
  {
    "id": "aloos_deniel",
    "name": "Aloïs Deniel",
    "title": "GDE",
    "company": "Freelance",
    "social": {
      "twitter": "https://twitter.com/aloisdeniel",
      "github": "https://github.com/aloisdeniel/",
      "linkedin": ""
    },
    "talk": {
      "title": "Custom design systems: from design to widgets",
      "description": "<p>During this talk, we'll see how to help UX/UI designers and Flutter developers to collaborate, and how to transition efficiently from visual prototypes to Flutter widgets.</p><p>First, we'll see how designers can architecture their design system in a way that makes it easier for developers to implement. Then we'll see which base widgets should be used to build your own widget library and create a visual experience that really matches the original prototypes.</p><p>The UX/UI design software used during this presentation will be Figma, but the general concepts behind it will be adaptable to other software as well.</p>",
      "lightening": false
    },
    "bio": "I'm a french Flutter freelance developer from France. I love contributing to the Flutter community by participating to open source projects and creating content. I'm also a Google Developer Expert."
  },
  {
    "id": "kamal_shree",
    "name": "kamal Shree S",
    "title": "GDE",
    "company": "",
    "social": {
      "twitter": "https://twitter.com/whatsupcoders",
      "github": "https://github.com/whatsupcoders",
      "linkedin": ""
    },
    "talk": {
      "title": "Common mistakes to avoid while developing a Flutter App",
      "description": "I believe in this quote “Learn from your mistakes” and most of the time we are taught the right way, best practices in developing a Flutter app. I’m sure you will agree that the best solutions do not pop in the first attempt they are created after several retries, debugging, and mistakes. In this talk, I would be focusing and sharing on the most common mistakes you are prone to making while developing Flutter apps or the best outcomes that I have learned from making these mistakes.Whether it is a selection of UI widgets that needs to be done considering both platforms i.e., Android & iOS, or choosing the state management or the database, or can I stuff my app with plugins are there any limitations.This session would be scenario-based, and the audience will discover the strength and utility of Flutter when applied to real-world programming instances.",
      "lightening": false
    },
    "bio": "Google Developer Expert in Flutter & Dart with 12 years of experience in Web Technologies, Android, and Flutter. I have worked for multinational firms in India, the Netherlands and USA. I am a Youtuber (whatsupcoders), Mentor @MentorCruise and Open-Source Community Builder."
  },
  {
    "id": "dominik_roszkowski",
    "name": "Dominik Roszkowski",
    "title": "GDE / Principle Engineer",
    "company": "VGV",
    "social": {
      "twitter": "https://twitter.com/OrestesGaolin",
      "github": "http://github.com/orestesgaolin",
      "linkedin": ""
    },
    "talk": {
      "title": "Improve your animations skills in Flutter",
      "description": "One of the main selling points of Flutter is its ability to quickly build stunning user interfaces and animations. In this talk you’ll learn how to improve building complex animations, micro-interactions and navigation transitions. I will show you techniques that help me debug and execute them without wasting a lot of time. We'll look into some performance optimization techniques as well.",
      "lightening": false
    },
    "bio": "Dominik is Google Developer Expert in Flutter eager to create beautiful apps for mobile and desktop. He’s Principal Developer at Very Good Ventures and co-founder of Flutter Europe conference. He is active speaker on local meetups and writes Flutter-related articles on his blog roszkowski.dev. He’s been working as a deputy manager of PW-Sat2 student satellite project."
  },
  {
    "id": "chris_swan",
    "name": "Chris Swan",
    "title": "Senior Engineer",
    "company": "The @ Company",
    "social": {
      "twitter": "https://twitter.com/cpswan",
      "github": "",
      "linkedin": "https://www.linkedin.com/in/chrisswan/"
    },
    "talk": {
      "title": "Full Stack Dart",
      "description": "Flutter provides an excellent way to build Android, iOS, web and desktop apps, but what about the back end services? Full stack Dart is all about using that investment in Dart programming to build the services used by applications, whether it's in the cloud or on the Internet of Things. This presentation will look at the tradeoffs between just in time (JIT) and ahead of time (AOT) compilation, Dart on Docker, the Functions Framework for Dart, Profiling and Performance Management. Choices of back end architecture (x86_64 vs Arm) will also be examined, along with some of the challenges this can present for Continuous Delivery.",
      "lightening": false
    },
    "bio": "Chris Swan is an Engineer at The @ Company, building the @platform, a technology that is putting people in control of their data and removing the frictions and surveillance associated with today’s Internet. He was previously a Fellow at DXC Technology where he held various CTO roles. Before that he held CTO and Director of R&D roles at Cohesive Networks, UBS, Capital SCF and Credit Suisse, where he worked on app servers, compute grids, security, mobile, cloud, networking and containers. Chris is an InfoQ Editor writing about cloud, DevOps and security, and co-hosts the Tech Debt Burndown Podcast."
  },
  {
    "id": "kevin_suhajda",
    "name": "Kevin Suhajda",
    "title": "Solutions Engineer",
    "company": "CodeMagic",
    "social": {
      "twitter": "https://twitter.com/kevsuda",
      "github": "",
      "linkedin": ""
    },
    "talk": {
      "title": "How to build and publish Flutter Desktop apps",
      "description": "Come and explore the magical world of desktop applications. If you thought iOS releases are difficult you haven’t seen anything yet :) Luckily Kevin has gone through the pains first hand and is happy to share the learnings how to publish to the stores and set up CI/CD to do that for Windows, macOS, and Linux apps",
      "lightening": true
    },
    "bio": "Kevin helps people discover the benefit of using Codemagic CI/CD for testing, building and distributing their mobile apps. He has worked as a solutions engineer and mobile application developer and loves to find out how things work and solving technical problems. In his spare time he likes playing guitar and hiking."
  },
  {
    "id": "sakina_abbas",
    "name": "Sakina Abbas",
    "title": "GDE",
    "company": "",
    "social": {
      "twitter": "https://twitter.com/sakin8tor",
      "github": "https://github.com/sakina-abbas",
      "linkedin": ""
    },
    "talk": {
      "title": "Working with Background Services in Flutter",
      "description": "Some applications require that the code is still being executed even when the app is no longer running in the foreground. A good example is an Uber Captain's app that is always listening for nearby ride requests. This talk will demonstrate how the use of Background Services can achieve seamless code execution of a Flutter app in the background. You will learn about a Flutter app's lifecycle, the concept of Services and Isolates and certain plugins that can be used for background code execution in Flutter, and at the end, you will also see a working app executing its code in the background - without any user interaction!",
      "lightening": false
    },
    "bio": "Co-founder and CEO of Reactree and the first female Google Developer Expert for Flutter and Dart in Pakistan, Sakina Abbas is all about solving problems through technology. She started off as a native Android developer and is now leading Flutter development and DevOps at ReacTree. To date, she has provided consultancies to numerous international and local clients and has built a number of custom solutions. She's an avid gamer, and much of her personal work is inspired by games."
  },
  {
    "id": "vilson_blanco_dauinheimer",
    "name": "Vilson Blanco Dauinheimer",
    "title": "",
    "company": "",
    "social": {
      "twitter": "https://twitter.com/BwolfDev",
      "github": "https://github.com/bwolfs2",
      "linkedin": ""
    },
    "talk": {
      "title": "Micro-Apps || Micro Front-Ends",
      "description": "When we think about larger applications and larger teams, we can't escape separating our application into modules or packages. If you've ever worked in larger companies, you may have noticed that almost everything is separated into smaller Squads with well-defined roles. The talk intends to demonstrate how we are developing in apps in an uncoupled, organized and very simple way to be reused in different scenarios of the company. Micro-Apps or Micro-FrontEnds in flutter are almost apps that have full functionality or with few external dependencies and reusable, the most common example is the Authentication Module that has only the functions of Login, Logout, Register and password Recover, this Module in question is used by all Projects of the company making that when starting a new project we no longer need to worry about Authentication. Working in this way we were able to increase team productivity by reusing code and applying single responsibility where each module has a specific function, this module can be maintained by a specific and specialized team in a given context such as a Payment Module or a Module of HR. This talk aims to show a more advanced content of Flutter presenting an architecture based on packages and which is widely used in Brazilian companies, presenting a separation in Modules and also the use of Clean Architecture for a better organization of the project. ",
      "lightening": false
    },
    "bio": "Technology enthusiast, computer lover and for the possibility of turning ideas into reality. Being able to create, take something out of my mind and make it real is fascinating to me, especially in the mobile world using Flutter! Co-Founder and Organizer of Flutterando the Biggest Flutter Community of Brazil Google For Startups Mentor Flutter Specialist at F-Team"
  },
  {
    "id": "aleksandr_denisov",
    "name": "Aleksandr Denisov",
    "title": "GDE",
    "company": "",
    "social": {
      "twitter": "https://twitter.com/shuregdenisov",
      "github": "https://github.com/DenisovAV",
      "linkedin": ""
    },
    "talk": {
      "title": "Flutter for TV platforms",
      "description": "Flutter for Mobile is released, Flutter for Web is in beta, Flutter for MacOs, Linux and Windows is in Alpha and it's really cool that Flutter officially supports six platforms. But what if I want to run my Flutter app on the TV? Unfortunately, nobody has heard of the official Flutter for TV yet. Actually, a Flutter app can be launched on TV (not AndroidTV only, but AppleTV, Tizen and others as well). In my talk, I'm going to tell you how to do this, and what difficulties and issues you will face and how to resolve them.",
      "lightening": false
    },
    "bio": "Aleksander is experienced a lot in enterprise development, in IT for more than 15 years. He worked in many different domains with many different technologies, but currently, his main interest is multi-platform development using Flutter. Aleksandr, Chief Software Engineer, Co-Head of Flutter Competency at EPAM Systems, Flutter and Dart GDE (Google Developer Expert), organizer of GDG Moscow community, host of podcasts Mobile People Talks and Flutter Dev Podcast."
  },
  {
    "id": "waleed_arshad",
    "name": "Waleed Arshad",
    "title": "GDE",
    "company": "",
    "social": {
      "twitter": "https://twitter.com/wal_33d",
      "github": "https://github.com/wal33d006",
      "linkedin": ""
    },
    "talk": {
      "title": "Spice up your Flutter apps with Shortcuts & Actions",
      "description": "Since a lot of developers are moving their Flutter applications to support the Web and Desktop, I propose something that will help them increase the user experience of their applications. This talk majorly focuses on adding shortcuts and actions to Flutter applications using Intents, without having to add any third party plugins/packages in the code. For example, a Flutter desktop app, or a Flutter web app has a writing/editing feature along with the ability to save things. In this case ideally the common gesture to achieve this is Ctrl+S for “save”, Ctrl+A for “select all”,  Ctrl+C for “copy”, and so on. With Intents and Actions widget in Flutter, it is all possible with simplicity and minimum amount of code. This session will have most of its part as live coding stuff.",
      "lightening": false
    },
    "bio": "Waleed Arshad is a core mobile technologist, an author, and a passionate cross-platform developer. He has recently authored a book named “Manage State in Flutter Pragmatically”. He is also the first person from Pakistan to become a Google Developer Expert in Flutter. After graduating from FAST Karachi, he has been working in the industry for more than five years and is currently working in the Developer Experience team for Flutter at Tendermint Inc.. He is also leading Pakistan’s Flutter community."
  },
  {
    "id": "morgan_hunt",
    "name": "Morgan Hunt",
    "title": "Flutter developer",
    "company": "",
    "social": {
      "twitter": "https://twitter.com/mrgnhnt96_dev",
      "github": "https://github.com/mrgnhnt96",
      "linkedin": ""
    },
    "talk": {
      "title": "Create your own Code-Generating Package",
      "description": "In this session, I will walk the audience through what code-generation is, why we use it within our projects, and how every developer can create their own code-gen package. What is Code Generation I'll discuss what code generation is and the issues and mundane tasks that it tries to solve. I will talk about the reasons how generating code can reduce errors and code that requires maintenance. Why use Code Generation One of the more prominent solutions that code generation provides is maintenance reduction. I'll discuss some popular packages and the pain points that they try to solve through code generation. I'll demonstrate a common task that happens in almost every project and how it can be solve using a code-gen package. Then I will compare the old maintenance-required code to the newly, almost maintenance free, generated code. Create your own code-gen package Finally, I'll break down the minimum code needed to set up your own code generating package, solving a problem in a particular project. Starting by demonstrating how to create annotations & it's generator, the available options for part files, settings via the build.yaml file, and testing.",
      "lightening": false
    },
    "bio": "Morgan is a die-hard Flutter developer 💙. He has been developing in Flutter non-stop since Flutter 1.12 was released! Morgan has been developing many dart & flutter packages, and contributing to as many open-source projects as he can. He currently works full-time at Clean Simple Eats with a bit of freelance on the side because he can't control how much he loves to code."
  },
  {
    "id": "minas_giannekas",
    "name": "Minas Giannekas",
    "title": "Flutter developer",
    "company": "Self-employed",
    "social": {
      "twitter": "https://twitter.com/whiplashoo",
      "github": "https://github.com/whiplashoo",
      "linkedin": ""
    },
    "talk": {
      "title": "Using Flutter to build a native-looking desktop app for macOS and Windows",
      "description": "It is indeed possible to achieve an adaptive and native-looking UI for desktop platforms with Flutter. In my talk, I will be presenting the methods and tools I used to build and ship a Flutter desktop app for macOS and Windows, with a UI that matches closely each platform's design standards (components like buttons or icons, typography, animations, title bars, etc.). ",
      "lightening": true
    },
    "bio": "I am a self-employed app developer. My main background is web development, but I have been using Flutter for the past year or so and have published apps for all platforms, mobile and desktop. I also contribute to open-source and am an author of a couple of Flutter packages. "
  },
  {
    "id": "abhishek_yatinkumar_doshi",
    "name": "Abhishek Doshi",
    "title": "GDE",
    "company": "",
    "social": {
      "twitter": "https://twitter.com/AbhishekDoshi26",
      "github": "https://github.com/AbhishekDoshi26",
      "linkedin": ""
    },
    "talk": {
      "title": "Nature or Flutter? Who has the best trees?",
      "description": "Nature has wide variety of trees. However Flutter also has 3 types of trees. What are the use of those trees? How Flutter creates, renders and destroys a widget? What is the role of state and State Management? Let's check it out in the session!",
      "lightening": true
    },
    "bio": "I am a Google Developer Expert for Dart and Flutter! I am also one of the Google Mentors. 💙 I currently work as a Sr. Flutter Engineer at Somnio Software. I am also the Organizer of Flutter Valsad and Co-Organizer of Flutter India. During the daytime, I manage different projects, take interviews for the Flutter Developer position, and help the team with issues. After work, I write articles for the community and help people leverage their careers in Flutter."
  },
  {
    "id": "cagatay_ulusoy",
    "name": "Cagatay Ulusoy",
    "title": "Flutter Developer",
    "company": "",
    "social": {
      "twitter": "https://twitter.com/ulusoyapps",
      "github": "https://github.com/ulusoyca",
      "linkedin": ""
    },
    "talk": {
      "title": "From Motion Design Specs To Flutter Code",
      "description": "Motion is one of the pillars helping users guide through their journey. It is the most distinctive way to show what is happening on the screen. Motion eases the cognitive load, ‘lets’ the product interact with the user and shows the hierarchy of the elements. It also affects customer satisfaction by enhancing the experience with micro-interactions and aesthetic brand elements. In a production stage, animated transition previews are not enough to communicate to engineers. To achieve the best result and reduce friction between designers and engineers, motion specifications are needed. In this talk, we will talk about how to implement UI with Flutter according to the motion specs received from motion designers.",
      "lightening": false
    },
    "bio": "Cagatay is a Software Engineer specialized in Android and Flutter application development. He is currently working as a software engineer at Wolt, in the retail team. He is passionate about blogging and vlogging his ultra trail races, sharing knowledge in the Flutter community with sample apps and articles."
  },
  {
    "id": "gordon_hayes",
    "name": "Gordon Hayes",
    "title": "Flutter Developer Advocate",
    "company": "Stream",
    "social": {
      "twitter": "https://twitter.com/gordonphayes",
      "github": "https://github.com/funwithflutter",
      "linkedin": ""
    },
    "talk": {
      "title": "Tips, Tricks and Tools: Flutter Performance",
      "description": "Brief intro on Widgets, Element and RenderObjects - as this is important to understand to get a cleaner picture of why something could have a performance impact.  This talk can be very technical and the focus can be on more advance performance metrics. But I want it to strike a nice in-between. Starting with easy tips, and moving on to some more complex scenarios. So there will be something for every level hopefully.",
      "lightening": false
    },
    "bio": "Flutter Developer Advocate at Stream. Creator of the Fun with Flutter YouTube Channel."
  },
  {
    "id": "tom_gilder",
    "name": "Tom Gilder",
    "title": "Flutter Developer",
    "company": "",
    "social": {
      "twitter": "https://twitter.com/tomgilder",
      "github": "https://github.com/tomgilder",
      "linkedin": ""
    },
    "talk": {
      "title": "Navigator 2.0: huh? What’s wrong with .push()?",
      "description": " This talk is an overview and tour of the Flutter Router (aka Navigator 2.0) API.",
      "lightening": false
    },
    "bio": "Tom makes awesome apps with Flutter at Codemate in Helsinki. He's been working professionally with Flutter for the past 3 years, and is the author of the popular Routemaster navigation package."
  },
  {
    "id": "krzysztof_sroka",
    "name": "Krzysztof Krasiński-Sroka",
    "title": "GDE",
    "company": "",
    "social": {
      "twitter": "https://twitter.com/kpsroka",
      "github": "https://github.com/kpsroka",
      "linkedin": ""
    },
    "talk": {
      "title": "When Flutter Goes Red",
      "description": "Whoopsie-daisy! Your perfect Flutter Widget just rendered as a glaring red box. Was it another overflow by infinity pixels, or maybe a classic division by zero in your build method? In this talk, we'll go through techniques of investigating common errors in your Flutter code, from the well known and loved debugPrint() to diving deeper in the DevTools to investigate the SDK methods that just take too much time.",
      "lightening": false
    },
    "bio": "Krzysztof is an experienced developer with passion for creating beautiful and useful user interfaces. Throughout his career he worked on a variety of products, starting from testing tools, data-crunching pipelines, web technologies, and finally mobile apps. Apart from being a developer, he is also a founder and tech lead of Widgeters, a Flutter development consultancy, and a Google Developer Expert for Dart and Flutter."
  },
  {
    "id": "anna_leushchenko",
    "name": "Anna Leushchenko",
    "title": "GDE",
    "company": "",
    "social": {
      "twitter": "https://twitter.com/AnnaLeushchenko",
      "github": "https://github.com/foxanna",
      "linkedin": "https://www.linkedin.com/in/annaleushchenko/"
    },
    "talk": {
      "title": "Trash talk: WHENs and HOWs of Dart VM’s GC",
      "description": "<p>In the dark deeps of Dart VM, where trees are boughy, tracks are twisted, and the space is limited, there lives a bright hero, who always welcomes new visitors, helps them find their way and stay connected to the roots, respects their age; who cares about the environment and diligently collects and recycles the garbage, freeing up space for new visitors.</p><p>Garbage Collector rarely gets the love and attention it deserves. Even though every Flutter developer has it as their friend, only few know it close enough, what it is like, and how it behaves.</p><p>I am determined to fix this injustice by spreading the word about all the good things Dart VM’s Garbage Collector does: we’ll look at how Dart objects are allocated, managed, and moved around, and when and how they get collected.</p>",
      "lightening": false
    },
    "bio": "Anna is a mobile development expert, passionate about quality software, focused on Flutter. For 7 years she has been creating cross-platform apps using Xamarin and Flutter technologies from sketches on a napkin to delivering functional and beautiful products to happy end-users. Anna is a Google Developer Expert in Dart and Flutter. First in Ukraine. She is a conference speaker and author of articles on different topics related to Flutter and Xamarin. Anna contributes to OSS. She also has an interest in mobile apps design."
  },
  {
    "id": "oleksandr_leushchenko",
    "name": "Oleksandr Leushchenko",
    "title": "GDE",
    "company": "",
    "social": {
      "twitter": "https://twitter.com/olexale",
      "github": "https://github.com/olexale",
      "linkedin": ""
    },
    "talk": {
      "title": "BDD in Flutter",
      "description": "BDD stands for Behaviour-Driven Development, but the development part is rather a side-effect. What does really BDD states? The main goal is to get developers, testers, and stakeholders to talk to each other. In order to create and share the same understanding of the product flow, we use Gherkin - a native-like language that is easy to read even for deeply non-technical persons. During my talk, we'll review the Gherkin basics and see how BDD might help to build better Flutter apps in practice. P.S. oh, by the way, you'll get familiar with the easiest way to start the test-first development approach for free!",
      "lightening": false
    },
    "bio": "Oleksandr is a public speaker, lecturer, AR enthusiast, OSS contributor, mentor, and mobile developer since 2012. He is passionate about software engineering best practices, test-first approach, and automation. Throughout his career, he has build digital products for dozens of clients and helped many developers grow professionally. From 2019 Oleksandr popularizes Flutter in Ukraine; he is a founder of a local Flutter community. In his free time, he likes to play guitar, sing, and read non-fiction literature."
  },
  {
    "id": "guillaume_bernos",
    "name": "Guillaume Bernos",
    "title": "Flutter Engineer",
    "company": "",
    "social": {
      "twitter": "https://twitter.com/BeGuillaume",
      "github": "https://github.com/Lyokone",
      "linkedin": ""
    },
    "talk": {
      "title": "Use OpenApi generator to share your models between Flutter and your backend",
      "description": "OpenApi is a standard to describe a REST api. By following an OpenAPI document, you can be sure that your frontend will make the correct backend requests. But how to take advantage of OpenAPI to simplify your development workflow? And how to make sure that you will not make mistakes when reading the OpenAPI documentation ? In this presentation I will: - Present quickly the OpenAPI specification, how a route is described in the format and how to represent common patterns (objects, lists …) - Present the openapi-generator-cli project on GitHub - Explain how to automate the process of creating the client package - How to import the package locally and how to use it - Explain how you can also do the same thing for the backend and be sure that both the backend and the frontend are using the same API With this presentation, an attendee will be able to know why generating an API client with the help of OpenAPI can save time and remove bugs from an app. He will be able to generate on its own a client package. Using this method to generate my client API saves me so much time that I would love to share it with Flutter Vikings! ",
      "lightening": false
    },
    "bio": "I'm a Flutter enthusiast for personal and professional projects, and author of the Flutter Favorite's `location` library. I discovered Flutter during the alpha and have been working with it ever since."
  },
  {
    "id": "kubra_selcuk",
    "name": "Kübra Selçuk",
    "title": "Flutter Engineer",
    "company": "",
    "social": {
      "twitter": "",
      "github": "https://github.com/KubraSelcuk",
      "linkedin": ""
    },
    "talk": {
      "title": "3D Objects in Flutter",
      "description": "3D Objects provide a great user experience when used for various purposes. And adding such type of visualization, which in turn helps your app to grow and maybe you can reach to many users.In this talk, we will talk about how to implement 3D Object packages in Flutter.",
      "lightening": true
    },
    "bio": "Kübra has worked as an R&D Engineer and Flutter Developer, she is know an Freelance Mobile Application Developer."
  },
  {
    "id": "lukas_klingsbo",
    "name": "Lukas Klingsbo",
    "title": "Flutter Developer",
    "company": "",
    "social": {
      "twitter": "https://twitter.com/spyd0n",
      "github": "https://github.com/spydon/",
      "linkedin": ""
    },
    "talk": {
      "title": "Game development with the Flame engine",
      "description": "<p>In this talk we will have a look at Flame's first stable release (1.0.0) and how to start creating games with it, no previous game dev experience is needed.</p> <p>After this talk you will be able to understand the basic concepts of Flame and how to use them to start making Flame games.<p> <p>We will go through:</p> <p> - What a game loop is.</p> <p>- The boilerplate needed to start creating a Flame game.</p> <p>- What the Flame Component System (FCS) is.</p> <p>- Some important components.</p> <p>- A brief introduction to the effects system.</p> <p>- A brief introduction to the collision detection system.</p> <p>- DebugMode.</p> <p>- Bridge packages.</p><p>- How to get help if you get stuck.</p><p>With these building blocks you will be able to start making your own games in no time!</p>",
      "lightening": false
    },
    "bio": "I'm a member of the Blue Fire open source collective which focuses on bringing great libraries to the Flutter community, our biggest project is the Flame Game engine, the only game engine for Flutter."
  },

  {
    "id": "aditya_thakur",
    "name": "Aditya Thakur",
    "title": "Flutter Developer",
    "company": "",
    "social": {
      "twitter": "https://twitter.com/adityathakurxd",
      "github": "https://github.com/adityathakurxd",
      "linkedin": ""
    },
    "talk": {
      "title": "Flutter Lints to rescue",
      "description": "The talk would be on harnessing the power of the flutter_lints package to set some rules when writing code. As of Flutter version 2.3.0-12.0.pre or newer, the latest set of recommended lints are already enabled to use. Although for older projects, would like to take up migration to latest recommended lints. And, for the newer ones talk about some of these rules and how they can be used to advantage.I recently had worked to migrate the Flutter Community plus_plugins from the deprecated pedantic to flutter_lints (Link: https://github.com/fluttercommunity/plus_plugins/pull/519) and, would like to share my experience based on that.",
      "lightening": true
    },
    "bio": "I am a Developer and Designer with experience in building cross platform applications. I also have a 5000 subscriber YouTube channel where I make videos on Flutter and a 600+ community on Discord. Previously, I have been a speaker at clubs and universities across India and the Flutter Global Summit 2021."
  }
]
